In [46]:
a=data.frame(emp_id=c(1,2,3),
             emp_name=c("Nirmala","Lavanya","Satya"),
             emp_date=as.Date(c("2019-06-19","2019-08-20","2012-07-19")),
             gen=factor(c("F","F","M")))
            print(a)

  emp_id emp_name   emp_date gen
1      1  Nirmala 2019-06-19   F
2      2  Lavanya 2019-08-20   F
3      3    Satya 2012-07-19   M

In [47]:
#sort w joining date
a[with(a,order(a$emp_date)),]

  emp_id emp_name emp_date   gen
3 3      Satya    2012-07-19 M
1 1      Nirmala  2019-06-19 F
2 2      Lavanya  2019-08-20 F

In [48]:
a[with(a,order(a$emp_id))]

  emp_id emp_name emp_date
1 1      Nirmala  2019-06-19
2 2      Lavanya  2019-08-20
3 3      Satya    2012-07-19

In [49]:
a[with(a,order(c(a$emp_id))),]

  emp_id emp_name emp_date   gen
1 1      Nirmala  2019-06-19 F
2 2      Lavanya  2019-08-20 F
3 3      Satya    2012-07-19 M

In [50]:
a$emp_dept=c("CSE","PHY","MATHS")

In [51]:
a

  emp_id emp_name emp_date   gen emp_dept
1 1      Nirmala  2019-06-19 F   CSE
2 2      Lavanya  2019-08-20 F   PHY
3 3      Satya    2012-07-19 M   MATHS

In [52]:
b=data.frame(emp_id=c(4,5),
             emp_name=c("Gaja","Mithun"),
             emp_date=as.Date(c("2019-06-13","2019-08-02")),
             gen=factor(c("M","M")),
            emp_dept=(c("phy2","MATHS2")))

In [53]:
b

  emp_id emp_name emp_date   gen emp_dept
1 4      Gaja     2019-06-13 M   phy2
2 5      Mithun   2019-08-02 M   MATHS2

In [54]:
c=rbind(a,b)

In [55]:
c

  emp_id emp_name emp_date   gen emp_dept
1 1      Nirmala  2019-06-19 F   CSE
2 2      Lavanya  2019-08-20 F   PHY
3 3      Satya    2012-07-19 M   MATHS
4 4      Gaja     2019-06-13 M   phy2
5 5      Mithun   2019-08-02 M   MATHS2

In [56]:
d=subset(a,select=-c(emp_dept))    #remove col

In [57]:
d

  emp_id emp_name emp_date   gen
1 1      Nirmala  2019-06-19 F
2 2      Lavanya  2019-08-20 F
3 3      Satya    2012-07-19 M

In [58]:
c=a[-c(1),]           #remove row
c

  emp_id emp_name emp_date   gen emp_dept
2 2      Lavanya  2019-08-20 F   PHY
3 3      Satya    2012-07-19 M   MATHS

In [69]:
df1=data.frame(stu_id=c(101,102,103,104,105,106),                                           
             pdt=c("one","two","three","four","five","six")
             )
            df1

  stu_id pdt
1 101    one
2 102    two
3 103    three
4 104    four
5 105    five
6 106    six

In [70]:
df2=data.frame(stu_id=c(102,104,106,107,108),
             standard=c("a","b","c","d","e")
             )
            df2

  stu_id standard
1 102    a
2 104    b
3 106    c
4 107    d
5 108    e

In [71]:
df3=merge(x=df1,y=df2,by="stu_id",all.x=TRUE)
df3                                                             #LOJ3

  stu_id pdt   standard
1 101    one   NA
2 102    two   a
3 103    three NA
4 104    four  b
5 105    five  NA
6 106    six   c

In [72]:
df4=merge(x=df1,y=df2,by="stu_id",all=TRUE)                    #FOJ
df4

  stu_id pdt   standard
1 101    one   NA
2 102    two   a
3 103    three NA
4 104    four  b
5 105    five  NA
6 106    six   c
7 107    NA    d
8 108    NA    e

In [73]:
df5=merge(x=df1,y=df2,by="stu_id",all=FALSE)                #natural join
df5

  stu_id pdt  standard
1 102    two  a
2 104    four b
3 106    six  c

In [74]:
df6=merge(x=df1,y=df2,by="stu_id",all.y=TRUE)                #roj join
df6

  stu_id pdt  standard
1 102    two  a
2 104    four b
3 106    six  c
4 107    NA   d
5 108    NA   e

In [78]:
a=as.integer(readline("input"))
if(a%%2==0)
    {print("even")
    }else{print("odd")}

input6
[1] "even"

In [79]:
l=list(1,2,3,4,5)
for(x in l)
    {if (x==2)
        {break
        }
    print(x)
    }

[1] 1

In [87]:
num=153
sum=0
temp=num
while(num>0)
    {digit=num%%10
    sum=sum+(digit^3)
    num=floor(num/10)
    print(sum)}
if(temp==sum)
    {print("yes,it is the armstrong ")
    } else("no,it isnt armstrong number")

[1] 27
[1] 152
[1] 153
[1] "yes,it is the armstrong "

In [88]:
num=153
sum=0
temp=num
while(num>0)
    {digit=num%%10
    sum=sum+(digit^3)
    num=floor(num/10)
    print(sum)}
if(temp==sum)
    {print("yes,it is the armstrong ")
    } else("no,it isnt armstrong number")

[1] 27
[1] 152
[1] 153
[1] "yes,it is the armstrong "

In [93]:
num=153
sum=0
temp=num
while(num>0)
    {digit=num%%10
    num=floor(num/10)
     sum=sum+(digit)
    }
print(sum)

[1] 9

In [98]:
num=851
rev=0
temp=num
while(num>0)
    {digit=num%%10
    num=floor(num/10)
    rev=rev*10+(digit)
    }
print(rev)
if(temp==rev){print("it is a palindrome")}else{print("it is not")}

[1] 158
[1] "it is not"